app/views/movies/index.html.erb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R')  ORDER BY title
---
    <tr>
      <th class=<%=@title_style%> ><%= link_to "Movie Title", movies_path(:orderby => "title", :ratings => @ratings_to_show.map { |r| [r, 1]}.to_h, :home => 1)%></th>