app/controllers/movies_controller.rb

    def show
      id = params[:id] # retrieve movie ID from URI route
      @movie = Movie.find(id) # look up movie by unique ID
      @review = Review.where(:movie_id => id, :moviegoer_id => @current_user.id).first
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = $1 AND "reviews"."moviegoer_id" = $2  ORDER BY "reviews"."id" ASC LIMIT 1  [["movie_id", 1], ["moviegoer_id", 1]]

    def index
      @all_ratings = Movie.all_ratings
      if params[:home]
        session[:ratings] = params[:ratings]
        session[:orderby] = params[:orderby]
      end
      @ratings_to_show = session[:ratings] ? session[:ratings].keys : []
      order = session[:orderby]
      @movies = Movie.with_ratings(@ratings_to_show).order(order)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R')  ORDER BY title

    def update
      @movie = Movie.find params[:id]
      @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "movies" SET "description" = $1, "updated_at" = $2 WHERE "movies"."id" = $3