app/controllers/reviews_controller.rb

  def create
    # since moviegoer_id is a protected attribute that won't get
    # assigned by the mass-assignment from params[:review], we set it
    # by using the << method on the association.  We could also
    # set it manually with review.moviegoer = @current_user.
    @current_user.reviews << @movie.reviews.build(review_params)
---
INSERT INTO "reviews" ("potatoes", "comments", "movie_id", "moviegoer_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["potatoes", 3], ["comments", "Good movie"], ["movie_id", 3], ["moviegoer_id", 1]]

  def index
    @movie = Movie.find(params[:movie_id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 3]]

  def edit
    @review = Review.where(:movie_id => params[:movie_id], :id => params[:id]).first
    @movie = Movie.find_by(:id => params[:movie_id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = $1 AND "reviews"."id" = $2  ORDER BY "reviews"."id" ASC LIMIT 1  [["movie_id", 1], ["id", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @review = Review.find params[:id]
    @review.update_attributes!(review_params)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "reviews" SET "potatoes" = $1 WHERE "reviews"."id" = $2  [["potatoes", 5], ["id", 1]]

  def destroy
    @review = Review.find(params[:id])
    @review.destroy
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 1]]