app/controllers/session_controller.rb

INSERT INTO "moviegoers" ("uid", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["uid", "29848596"], ["name", "Douglas Carneiro"], ["created_at", "2022-02-22 09:23:06.373526"], ["updated_at", "2022-02-22 09:23:06.373526"]]
SELECT  "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."uid" = $1  ORDER BY "moviegoers"."id" ASC LIMIT 1  [["uid", "29848596"]]
---
  def create
    auth = request.env["omniauth.auth"]
    Rails.logger.info auth
    Rails.logger.info 'Auth[uid] = '+auth["uid"]
    user =
      Moviegoer.where(uid: auth["uid"]).first ||
      Moviegoer.create_with_omniauth(auth)